; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image3 - mode
	infrared2 - mode
	spectrograph5 - mode
	thermograph1 - mode
	spectrograph6 - mode
	thermograph0 - mode
	spectrograph4 - mode
	Star0 - direction
	GroundStation1 - direction
	Star4 - direction
	Star3 - direction
	GroundStation2 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument1 spectrograph5)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph6)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
)
(:goal (and
	(have_image Planet5 image3)
	(have_image Planet5 thermograph1)
	(have_image Phenomenon6 thermograph1)
	(have_image Phenomenon6 spectrograph5)
	(have_image Star7 image3)
	(have_image Planet8 spectrograph4)
	(have_image Planet9 infrared2)
	(have_image Planet9 image3)
	(have_image Star10 image3)
	(have_image Star10 spectrograph4)
	(have_image Phenomenon11 infrared2)
))

)

; plan
1. (turn_to satellite1 groundstation2 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 11
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 11
3. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 11
4. (turn_to satellite1 phenomenon6 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon6)
   goals met: 0 of 11
5. (take_image satellite1 phenomenon6 instrument1 thermograph1)
   added: (have_image phenomenon6 thermograph1)
   goals met: 1 of 11
6. (take_image satellite1 phenomenon6 instrument1 spectrograph5)
   added: (have_image phenomenon6 spectrograph5)
   goals met: 2 of 11
7. (turn_to satellite1 phenomenon11 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 11
8. (turn_to satellite0 star3 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star3)
   goals met: 2 of 11
9. (take_image satellite1 phenomenon11 instrument1 infrared2)
   added: (have_image phenomenon11 infrared2)
   goals met: 3 of 11
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 11
11. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 3 of 11
12. (turn_to satellite0 planet5 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet5)
   goals met: 3 of 11
13. (take_image satellite0 planet5 instrument0 image3)
   added: (have_image planet5 image3)
   goals met: 4 of 11
14. (turn_to satellite0 planet8 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet8)
   goals met: 4 of 11
15. (take_image satellite0 planet8 instrument0 spectrograph4)
   added: (have_image planet8 spectrograph4)
   goals met: 5 of 11
16. (turn_to satellite0 planet9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet9)
   goals met: 5 of 11
17. (take_image satellite0 planet9 instrument0 image3)
   added: (have_image planet9 image3)
   goals met: 6 of 11
18. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 6 of 11
19. (take_image satellite0 star10 instrument0 image3)
   added: (have_image star10 image3)
   goals met: 7 of 11
20. (take_image satellite0 star10 instrument0 spectrograph4)
   added: (have_image star10 spectrograph4)
   goals met: 8 of 11
21. (turn_to satellite0 star7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star7)
   goals met: 8 of 11
22. (take_image satellite0 star7 instrument0 image3)
   added: (have_image star7 image3)
   goals met: 9 of 11
23. (turn_to satellite1 planet5 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet5)
   goals met: 9 of 11
24. (take_image satellite1 planet5 instrument1 thermograph1)
   added: (have_image planet5 thermograph1)
   goals met: 10 of 11
25. (turn_to satellite1 planet9 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet9)
   goals met: 10 of 11
26. (take_image satellite1 planet9 instrument1 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 11 of 11
